In [3]:
import pandas as pd

# Use test sample

In [48]:
db= pd.read_csv("data.csv",sep=",",header="infer")
row_id_pairs=pd.read_csv("row_id_pairs_test.txt",sep="|",header=-1)
row_id_pairs_list=[row_id_pairs.iloc[i].values.tolist() for i in range(len(row_id_pairs))]

In [49]:
db.head(10)

,row_id,NAME,STREET,CITY,STATE,ZIPCODE,block_id
0,1,Howard Love,6398 LONG POINT ROAD,Cicero,NY,13029,1001
1,2,Nicole Lunsford,816 S TAYLOR AVE,OGDEN CITY,UT,84404,1001
2,3,Daniel Cross,1031 ARTHUR MOORE DR,GREEN COVE SPRINGS,FL,NaN,1001
3,4,Sharon Saldana,JACKSON,IL,IL,NaN,1001
4,5,Patrick Saenz,83 ASTER DR 1715,IL,IL,NaN,1001
5,6,June Downin,69-12 62 AVENUE,NEW YORK,NY,11379,1001
6,7,Betty Johnson,20747 DYERS PASS,FARMINGTON,MN,55024,1001
7,8,Bill Chism,869 COUNTY ROAD D EAST Unit 301,Saint Paul,MN,55109,1001
8,9,Jon Lee,12537 CARMEL CT,HUNTLEY,IL,60142,1001
9,10,George Goldberg,18007 O HARA CIR,OLNEY,MD,20832,1001

In [39]:
row_id_pairs

   46731  46967
0  31040  41743
1  28106  38917
2  34096  42075
3  47204  47551
4  36720  22043
5   5098   6378
6  42296  22850
7   1034  37882
8  21304  13550

In [32]:
row_id_pairs_list

[[32689, 19576],
 [46731, 46967],
 [31040, 41743],
 [28106, 38917],
 [34096, 42075],
 [47204, 47551],
 [36720, 22043],
 [5098, 6378],
 [42296, 22850],
 [1034, 37882],
 [21304, 13550]]

In [110]:

def create_entity_pairs(db, row_id_pairs):
    data = pd.DataFrame()
    for pair in row_id_pairs:
        row_left = db[db['row_id'] == pair[0]].reset_index(drop=True)
        if isinstance(row_id_pairs, list):
            row_left = row_left.drop('block_id', axis=1)
        row_right = db[db['row_id'] == pair[1]].reset_index(drop=True)
        row = pd.concat([row_left, row_right], axis=1)
        data = data.append(row)
    return data

In [111]:
res= create_entity_pairs(db,row_id_pairs_list)

In [52]:
res

,row_id,NAME,STREET,CITY,STATE,ZIPCODE,row_id,NAME,STREET,CITY,STATE,ZIPCODE,block_id
0,32689,Amy Gilbert,1077 S WORTH ST,Birmingham,MI,48009,19576,James Wong,4623 S VALLEY HAVEN CT PUD,WEST VALLEY CITY,UT,84120,1001
0,46731,Roger Miller,443 10TH ST,SEMCOG,MI,48060,46967,Thomas Wood,28 HILLSIDE RD,NEWTON HIGHLANDS,MA,2461,1001
0,31040,James Utecht,5161 CHERRY BLOSSOM WAY,COLUMBUS,OH,43230,41743,Alexander Rhinehart,8123 MARSH,Chanhassen,MN,55317,1001
0,28106,Tiffany Story,15 GILBERT ROAD,BREWSTER,MA,2631,38917,Gina Burch,58301 PEACH RD,IN,IN,NaN,1001
0,34096,Sadie Matherly,1223 POPLAR RUN DR,MONTGOMERY,MD,NaN,42075,Jane Mcburney,505 NW 13TH ST,GRIMES,IA,50111,1001
0,47204,Alexander Kopf,7473 COLLINS RANCH CT,San Diego,CA,92130,47551,John Williams,8325 KIM RD,JACKSONVILLE,FL,32217,1001
0,36720,Carl Flowers,7326 N LILAC LN,MICHIGAN CITY,IN,46360,22043,Brendan Lueck,6301 MISTY WOOD WAY,SACRAMENTO,CA,95621,1001
0,5098,Dorothy Williams,7420 QUAIL HEIGHTS AVE,CLARK,NV,NaN,6378,Tom Font,912 EMMET ST,ST LOUIS,MO,NaN,1001
0,42296,Enoch Peck,732 SANTA ANA AVE,SACRAMENTO,CA,95838,22850,Jennifer Massey,210 GASTON DR,MADISON,AL,35758,1001
0,1034,Craig Danley,1560 MASSACHUSETTS AVE 149,RIVERSIDE,CA,92507,37882,Joseph Allen,4807 RAMER SELMER RD,STATEWIDE,TN,NaN,1001
0,21304,Angelica Mcdonell,536 1ST ST,Manhattan Beach,CA,90266,13550,Julio Durham,12609 257TH AVENUE,STATEWIDE,WI,NaN,1001

# Use total Sample

In [109]:
db= pd.read_csv("data.csv",sep=",",header="infer")
row_id_pairs=pd.read_csv("row_id_pairs_test.txt",sep="|",header=-1)
row_id_pairs_list=[row_id_pairs.iloc[i].values.tolist() for i in range(len(row_id_pairs))]

In [112]:
import time 
tic = time.time()
res= create_entity_pairs(db,row_id_pairs_list)
print(time.time()-tic)

7.396821022033691

In [185]:
def create_entity_pairs_updated(db, row_id_pairs):
    data = pd.DataFrame()
    for pair in row_id_pairs:
        row_left = db.ix[[pair[0]-1]].reset_index(drop=True)
        if isinstance(row_id_pairs, list):
            row_left = row_left.drop('block_id',axis=1)
        row_right = db.ix[[pair[1]-1]].reset_index(drop=True)
        row = pd.concat([row_left, row_right],axis=1)
        data = data.append(row)
    return data

In [122]:
row_left

0               32690
1     Brandon Goldman
2    130 CAROUSEL AVE
3        PORT LABELLE
4                  FL
5               33935
6                1001
Name: 32689, dtype: object

In [145]:
row

row_id                      32691
NAME              Lorraine Battle
STREET      2903 MOUNT VERNON AVE
CITY                   ALEXANDRIA
STATE                          VA
ZIPCODE                     22305
row_id                      33936
NAME                 Adell Barton
STREET            59 TROYS MARINA
CITY                   Springport
STATE                          NY
ZIPCODE                     13034
block_id                     1001
dtype: object

In [163]:
row.index

Index(['row_id', 'NAME', 'STREET', 'CITY', 'STATE', 'ZIPCODE', 'row_id',
       'NAME', 'STREET', 'CITY', 'STATE', 'ZIPCODE', 'block_id'],
      dtype='object')

In [183]:
row_left = db.ix[[32690]].reset_index(drop=True)
row_left = row_left.drop('block_id',axis=1)

In [186]:
import time 
tic = time.time()
res= create_entity_pairs_updated(db,row_id_pairs_list)
print(time.time()-tic)

7.111389636993408